balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ06GS102.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCPC0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCPC0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC0" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC0" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG0" edc:desc="" edc:mask="0x1" edc:name="SWTRG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND0" edc:desc="" edc:mask="0x1" edc:name="PEND0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN0" edc:desc="" edc:mask="0x1" edc:name="IRQEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC1" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC1" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG1" edc:desc="" edc:mask="0x1" edc:name="SWTRG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND1" edc:desc="" edc:mask="0x1" edc:name="PEND1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN1" edc:desc="" edc:mask="0x1" edc:name="IRQEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC00" edc:desc="" edc:mask="0x1" edc:name="TRGSRC00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC01" edc:desc="" edc:mask="0x1" edc:name="TRGSRC01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC02" edc:desc="" edc:mask="0x1" edc:name="TRGSRC02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC03" edc:desc="" edc:mask="0x1" edc:name="TRGSRC03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC04" edc:desc="" edc:mask="0x1" edc:name="TRGSRC04" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGSRC10" edc:desc="" edc:mask="0x1" edc:name="TRGSRC10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC11" edc:desc="" edc:mask="0x1" edc:name="TRGSRC11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC12" edc:desc="" edc:mask="0x1" edc:name="TRGSRC12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC13" edc:desc="" edc:mask="0x1" edc:name="TRGSRC13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC14" edc:desc="" edc:mask="0x1" edc:name="TRGSRC14" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="ADCPC1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="ADCPC1" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC2" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC2" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG2" edc:desc="" edc:mask="0x1" edc:name="SWTRG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND2" edc:desc="" edc:mask="0x1" edc:name="PEND2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN2" edc:desc="" edc:mask="0x1" edc:name="IRQEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC20" edc:desc="" edc:mask="0x1" edc:name="TRGSRC20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC21" edc:desc="" edc:mask="0x1" edc:name="TRGSRC21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC22" edc:desc="" edc:mask="0x1" edc:name="TRGSRC22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC23" edc:desc="" edc:mask="0x1" edc:name="TRGSRC23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC24" edc:desc="" edc:mask="0x1" edc:name="TRGSRC24" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="18"/>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF0" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF3" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
